1s/ERP/Conf/Documents/Лико_ПередачаТоваровМеждуОрганизациями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ПередачаТоваровМеждуОрганизациями</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПродавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПокупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПродавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПокупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПриобретения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПокупки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорМеждуОрганизациями</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипПередачиТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоглашениеПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоглашениеПокупки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лико_Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛикоДокументыЗатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьЗаГлавногоБухгалтера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьЗаРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьОтпустил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвязанныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Лико_ЗаявкаНаТранспортировку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипПередачиТоваровМеждуОрганизациями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипПередачиТоваровМеждуОрганизациями</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Интеркампани</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияИПоступление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ВариантыОформленияПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыОформленияПродажи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РеализацияТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктВыполненныхРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктНаПередачуПрав</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/СтатусыРеализацийТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыРеализацийТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КПредоплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/СпособыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчикаПоАдресу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПоставщикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчикаДоПунктаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашимиСиламиСАдресаОтправителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПолучателюОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтОтправителяОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеЭкспедиторуСоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеЭкспедиторуНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеЭкспедиторуВПункте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяВРаспоряжении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоКлиентаКурьером</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицоНеРезидент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ВариантыПриемкиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыПриемкиТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РазделенаПоЗаказамИНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРазделенаПоЗаказамИНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МожетПроисходитьБезЗаказовИНакладных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазделенаТолькоПоНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРазделенаПоНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДоговорамБезЗаказовИНакладных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДоговорамПослеЗаказовИлиНакладных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДоговорамПослеНакладных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентПоНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоФактическомуИспользованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаНаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаНеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭкспортСырьевыхТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭкспортНесырьевыхТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОСВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяРаспределением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяНДСУПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСДЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияРаботУслугНаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаПоПатенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеверсивноеОбложениеНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяНДССМежценовойРазницы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Космос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяНДСВСтранеЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛьготноеНалогообложениеНДСНаУСН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительКадровойСлужбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаБухгалтерскиеРегистры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаНалоговыеРегистры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УполномоченныйПредставитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаВУР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ПередачаТоваровМеждуОрганизациями/Ext/ObjectModule.bsl
Перем КлючиСтруктуры;

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если Товары.Количество() = 0 Тогда
		Отказ = Истина;
		Сообщить("В табличной части товаров нет строк");
	КонецЕсли;
	Если НЕ Отказ Тогда
		Отказ = НЕ СоздатьТиповыеДокументы();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	НачатьТранзакцию();
	//Пометим на удаление связанные типовые документы
	СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктуры, Ссылка,,"Лико_АвтоматическоеСоздание");
	Если СтруктураТиповыхДокументов = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	Если НЕ Отказ Тогда
		ЗафиксироватьТранзакцию();	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) И Ссылка.Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение И Ссылка.ТипДокумента <> ТипДокумента Тогда
		Отказ = Истина;
		Сообщить("" + Ссылка + ": нельзя менять тип документа у проведенного документа. Сначала распроведите документ.");
	КонецЕсли;
	
	Для каждого Строка из Товары Цикл
		Если НЕ ЗначениеЗаполнено(Строка.СтавкаНДС) И ЗначениеЗаполнено(Строка.УдалитьСтавкаНДС) Тогда
			Строка.СтавкаНДС = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Строка.УдалитьСтавкаНДС);
			Строка.УдалитьСтавкаНДС = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьТиповыеДокументы() Экспорт
	
	НачатьТранзакцию();
	
	ТаблицаНовыхДокументов = Новый ТаблицаЗначений;
	ТаблицаНовыхДокументов.Колонки.Добавить("Документ");
	
	//Сначала найдем уже сформированные типовые документы, распроведем их и будем заполнять заново
	СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктуры, Ссылка);
	Если СтруктураТиповыхДокументов = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипДокумента = Перечисления.Лико_ТипПередачиТоваровМеждуОрганизациями.РеализацияИПоступление Тогда
		
		// Создаем реализацию не проводя ее, т.к. товара еще нет на складе (по складским остаткам товаро продан клиенту).
		// Но реализация нам нужна перед созданием приобретения, чтобы записать в приобретение номер и дату входящего документа.
		// После проведения приобретения остатки товара появятся на складе и можно будет провести реализацию
		НовыйДокументРеализацияТоваровУслуг = СоздатьДокументРеализацияТоваровУслуг(СтруктураТиповыхДокументов.РеализацияТоваровУслуг);
		Если НовыйДокументРеализацияТоваровУслуг = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
		НоваяСтрока.Документ = НовыйДокументРеализацияТоваровУслуг;
			
		// Создаем приобретение
		НовыйДокументПриобретениеТоваровУслуг = СоздатьДокументПриобретениеТоваровУслуг(СтруктураТиповыхДокументов.ПриобретениеТоваровУслуг, НовыйДокументРеализацияТоваровУслуг);
		Если НовыйДокументПриобретениеТоваровУслуг = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
		НоваяСтрока.Документ = НовыйДокументПриобретениеТоваровУслуг;
		
		// Проводим реализацию
		РеализацияОбъект = НовыйДокументРеализацияТоваровУслуг.ПолучитьОбъект();
		Попытка
			РеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Транзацкия отменена. Не удалось провести реализаци. """ + РеализацияОбъект + """: " + ОписаниеОшибки());
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;		
		
		// Создаем счет-фактуру выданный
		НовыйДокументСчетФактураВыданный = СоздатьДокументСчетФактураВыданный(СтруктураТиповыхДокументов.СчетФактураВыданный, НовыйДокументРеализацияТоваровУслуг);
		Если НовыйДокументСчетФактураВыданный = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
		НоваяСтрока.Документ = НовыйДокументСчетФактураВыданный;
		
		// --> Начало Лико Ефимов ЕВВ 24.07.2020
		// на всякий случай проверим
		Если НовыйДокументСчетФактураВыданный.ПредставлениеНомера <> НовыйДокументПриобретениеТоваровУслуг.НомерВходящегоДокумента Тогда
			ПриобретениеОбъект = НовыйДокументПриобретениеТоваровУслуг.ПолучитьОбъект();
			ПриобретениеОбъект.НомерВходящегоДокумента = НовыйДокументСчетФактураВыданный.ПредставлениеНомера;
			Попытка
				ПриобретениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить("Транзацкия отменена. Не удалось провести приобретение. """ + ПриобретениеОбъект + """: " + ОписаниеОшибки());
				ОтменитьТранзакцию();
				ВызватьИсключение;
			КонецПопытки;
		КонецЕсли;
		// <-- Конец Лико Ефимов ЕВВ 24.07.2020

		// Создаем счет-фактуру полученный
		НовыйДокументСчетФактураПолученный = СоздатьДокументСчетФактураПолученный(СтруктураТиповыхДокументов.СчетФактураПолученный, НовыйДокументПриобретениеТоваровУслуг, НовыйДокументРеализацияТоваровУслуг);
		Если НовыйДокументСчетФактураПолученный = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
		НоваяСтрока.Документ = НовыйДокументСчетФактураПолученный;
	ИначеЕсли ТипДокумента = Перечисления.Лико_ТипПередачиТоваровМеждуОрганизациями.Интеркампани Тогда
		// Создаем передачу товаров между организациями
		НовыйДокументПередачаТоваровМеждуОрганизациями = СоздатьДокументПередачаТоваровМеждуОрганизациями(СтруктураТиповыхДокументов.ПередачаТоваровМеждуОрганизациями);
		Если НовыйДокументПередачаТоваровМеждуОрганизациями = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
		НоваяСтрока.Документ = НовыйДокументПередачаТоваровМеждуОрганизациями;
		
		// Создаем счет-фактуру выданный
		НовыйДокументСчетФактураВыданный = СоздатьДокументСчетФактураВыданный(СтруктураТиповыхДокументов.СчетФактураВыданный, НовыйДокументПередачаТоваровМеждуОрганизациями);
		Если НовыйДокументСчетФактураВыданный = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
		НоваяСтрока.Документ = НовыйДокументСчетФактураВыданный;
	Иначе
		Сообщить("Для типа документа """ + ТипДокумента + """ не определена логика программы");
		Возврат Ложь;
	КонецЕсли;
	
	
	//Запишем типовые документы в регистр Лико_СвязиСТиповымиДокументами
	Результат = Лико_Дополнительно.ЗаписатьТиповыеДокументыВРегистрЛико_СвязиСТиповымиДокументами(ТаблицаНовыхДокументов, Ссылка);
	Если НЕ Результат Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	Возврат Истина;
	
КонецФункции

Функция СоздатьДокументРеализацияТоваровУслуг(УжеСозданныйДокумент = Неопределено, Проводить = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НовыйДокОбъект.Дата = Дата;
	
	ВалютаРуб = Константы.ВалютаРегламентированногоУчета.Получить();
	ВалютаЕвр = Константы.ВалютаУправленческогоУчета.Получить();
	НовыйДокОбъект.Организация = ОрганизацияПродавец;
	НовыйДокОбъект.БанковскийСчетОрганизации = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитОрганизацииБанковскийСчетПоУмолчанию", НовыйДокОбъект.Организация);
	Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.БанковскийСчетОрганизации) Тогда
		НовыйДокОбъект.БанковскийСчетОрганизации = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(НовыйДокОбъект.Организация, ВалютаРуб);
	КонецЕсли;
	НовыйДокОбъект.Контрагент = КонтрагентПокупатель;
	НовыйДокОбъект.БанковскийСчетКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(НовыйДокОбъект.Контрагент, ВалютаРуб);
	НовыйДокОбъект.Валюта = Валюта;
	НовыйДокОбъект.ВалютаВзаиморасчетов = Валюта;
	НовыйДокОбъект.Партнер = НовыйДокОбъект.Контрагент.Партнер;
	НовыйДокОбъект.Склад = СкладПродажи;
	НовыйДокОбъект.Согласован = Истина;
	НовыйДокОбъект.Соглашение = СоглашениеПродажи;
	Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.Соглашение) Тогда
		Сообщить("Не заполнено соглашение продажи");
		Возврат Неопределено;
	КонецЕсли;
	НовыйДокОбъект.Договор = ДоговорПродажи;
	Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.Договор) Тогда
		Сообщить("Не заполнен договор продажи");
		Возврат Неопределено;
	КонецЕсли;
	НовыйДокОбъект.ОплатаВВалюте = НовыйДокОбъект.Договор.ОплатаВВалюте;
	НовыйДокОбъект.Подразделение = НовыйДокОбъект.Договор.Подразделение;
	// --> Начало Лико Ефимов ЕВВ 30.01.2025
	// для Линкс и икспак
	Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.Подразделение) Тогда
		НовыйДокОбъект.Подразделение = НовыйДокОбъект.Договор.Лико_Площадка.ПодразделениеПроизводство;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 30.01.2025
	// --> Начало Лико Ефимов ЕВВ 07.11.2019
	// для икс-пак
	//Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.Подразделение) Тогда
	//	НовыйДокОбъект.Подразделение = Справочники.Лико_ПредопределенныеЗначения.ПодразделениеПроизводство.ЗначениеПараметра;
	//КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 07.11.2019
	НовыйДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	НовыйДокОбъект.ЦенаВключаетНДС = ЦенаВключаетНДС;
	НовыйДокОбъект.Автор = Автор;
	НовыйДокОбъект.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
	НовыйДокОбъект.КурсЧислитель = 1;
	НовыйДокОбъект.КурсЗнаменатель = 1;
	НовыйДокОбъект.ПорядокРасчетов = НовыйДокОбъект.Договор.ПорядокРасчетов;
	//НовыйДокОбъект.ПорядокОплаты = НовыйДокОбъект.Договор.ПорядокОплаты;
	НовыйДокОбъект.ГруппаФинансовогоУчета = НовыйДокОбъект.Договор.ГруппаФинансовогоУчета;
	НовыйДокОбъект.Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;
	НовыйДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	НовыйДокОбъект.НалогообложениеНДС = НалогообложениеНДС;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	ЗаполнитьОтветственныхЛиц(НовыйДокОбъект);

	ТЗТовары = Товары.Выгрузить();
	ТЗТовары.Свернуть("Номенклатура,Характеристика,Цена,СтавкаНДС", "Количество,СуммаНДС,Сумма,СуммаСНДС");
	Для каждого Строка из ТЗТовары Цикл
		НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
		НоваяСтрока.Склад = НовыйДокОбъект.Склад;
	КонецЦикла;
	
	//НовыйДокОбъект.ЗаполнитьЭтапыГрафикаОплаты();
	
	НовыйДокОбъект.Лико_НеНужныДвиженияОрдерныхСкладов = Истина;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер,Сканы");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(?(Проводить, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
	Исключение
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось записать! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьДокументСчетФактураВыданный(УжеСозданныйДокумент = Неопределено, Основание)
	
	УстановитьПривилегированныйРежим(Истина);
		
	НовыйДокОбъект = Документы.СчетФактураВыданный.СоздатьДокумент();
	НовыйДокОбъект.Дата = Основание.Дата;
	НовыйДокОбъект.Номер = Основание.Номер;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ДокументОснование", Основание);
	ДанныеЗаполнения.Вставить("Организация", Основание.Организация);
	ДанныеЗаполнения.Вставить("ДатаВыставления", Основание.Дата);
	НовыйДокОбъект.Заполнить(ДанныеЗаполнения);
	Если НовыйДокОбъект.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент Тогда
		НовыйДокОбъект.Валюта = Основание.Валюта;
	КонецЕсли;
	НовыйДокОбъект.Ответственный = Основание.Менеджер;
	НовыйДокОбъект.ПредставлениеНомера = Документы.СчетФактураВыданный.ПолучитьПредставлениеНомера(НовыйДокОбъект);
	ЗаполнитьЗначенияСвойств(НовыйДокОбъект, Основание, "Руководитель,ГлавныйБухгалтер");
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Сканы");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;

	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьДокументПриобретениеТоваровУслуг(УжеСозданныйДокумент = Неопределено, Реализация) 

	НовыйДокОбъект=Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();	
	НовыйДокОбъект.Дата = Дата;
		
	ВалютаРуб = Константы.ВалютаРегламентированногоУчета.Получить();
	ВалютаЕвр = Константы.ВалютаУправленческогоУчета.Получить();
	
	НовыйДокОбъект.Организация = ОрганизацияПокупатель;
	
	НовыйДокОбъект.БанковскийСчетОрганизации = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитОрганизацииБанковскийСчетПоУмолчанию", НовыйДокОбъект.Организация);
	Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.БанковскийСчетОрганизации) Тогда
		НовыйДокОбъект.БанковскийСчетОрганизации = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(НовыйДокОбъект.Организация, ВалютаРуб);
	КонецЕсли;
	НовыйДокОбъект.Контрагент = КонтрагентПродавец;
	НовыйДокОбъект.БанковскийСчетКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(НовыйДокОбъект.Контрагент, ВалютаРуб);
	НовыйДокОбъект.Валюта = Валюта;
	НовыйДокОбъект.ВалютаВзаиморасчетов = Валюта;
	НовыйДокОбъект.НалогообложениеНДС = НалогообложениеНДС;
	НовыйДокОбъект.Партнер = НовыйДокОбъект.Контрагент.Партнер;
	НовыйДокОбъект.Склад = ?(ЗначениеЗаполнено(СкладПриобретения), СкладПриобретения, СкладПродажи);
	НовыйДокОбъект.Соглашение = СоглашениеПокупки;
	Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.Соглашение) Тогда
		Сообщить("Не заполнено соглашение покупки");
		Возврат Неопределено;
	КонецЕсли;
	НовыйДокОбъект.Договор = ДоговорПокупки;
	Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.Договор) Тогда
		Сообщить("Не заполнен договор покупки");
		Возврат Неопределено;
	КонецЕсли;
	НовыйДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	НовыйДокОбъект.ЦенаВключаетНДС = ЦенаВключаетНДС;
	НовыйДокОбъект.Автор = Автор;
	НовыйДокОбъект.КурсЧислитель = 1;
	НовыйДокОбъект.КурсЗнаменатель = 1;
	НовыйДокОбъект.ПорядокРасчетов = НовыйДокОбъект.Договор.ПорядокРасчетов;  		
	НовыйДокОбъект.НомерВходящегоДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реализация.Номер);
	НовыйДокОбъект.ДатаВходящегоДокумента = Реализация.Дата;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	НовыйДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада;
	НовыйДокОбъект.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	НовыйДокОбъект.ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	//НовыйДокОбъект.ПорядокОплаты = НовыйДокОбъект.Договор.ПорядокОплаты;
	НовыйДокОбъект.ГруппаФинансовогоУчета = НовыйДокОбъект.Договор.ГруппаФинансовогоУчета;
	НовыйДокОбъект.Подразделение = НовыйДокОбъект.Договор.Подразделение;
	// --> Начало Лико Ефимов ЕВВ 02.04.2025
	// для Линкс
	//Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.Подразделение) Тогда
	//	НовыйДокОбъект.Подразделение = НовыйДокОбъект.Договор.Лико_Площадка.ПодразделениеПроизводство;
	//КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 02.04.2025
	
	ТЗТовары = Товары.Выгрузить();
	ТЗТовары.Свернуть("Номенклатура,Характеристика,Цена,СтавкаНДС", "Количество,СуммаНДС,Сумма,СуммаСНДС");
	Для каждого Строка из ТЗТовары Цикл
		НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
		НоваяСтрока.Склад = НовыйДокОбъект.Склад;
	КонецЦикла;
	
	//НовыйДокОбъект.ЗаполнитьЭтапыГрафикаОплаты();
	
	НовыйДокОбъект.Лико_НеНужныДвиженияОрдерныхСкладов = Истина;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Сканы,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;

	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции 

Функция СоздатьДокументСчетФактураПолученный(УжеСозданныйДокумент = Неопределено, Поступление, Реализация)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокОбъект = Документы.СчетФактураПолученный.СоздатьДокумент();
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ДокументОснование", Поступление);
	ДанныеЗаполнения.Вставить("Организация", Поступление.Организация);
	ДанныеЗаполнения.Вставить("ДатаСоставления",  Поступление.Дата);
	НовыйДокОбъект.Заполнить(ДанныеЗаполнения);
	НовыйДокОбъект.Ответственный = Поступление.Автор;
	
	НовыйДокОбъект.Дата = Поступление.Дата;
	НовыйДокОбъект.Номер = Поступление.НомерВходящегоДокумента;
	НовыйДокОбъект.ДатаСоставления = Поступление.ДатаВходящегоДокумента;
	// --> Начало Лико Ефимов ЕВВ 22.04.2025
	Если Реализация.Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра
		И Реализация.Подразделение = Справочники.Лико_Площадки.Линкс.ПодразделениеПроизводство Тогда
		// Это обособленное подразделение Линкс. Пока делаю условие такое сложное, чтобы ничего лишнего не сломалось
		// В дальнейшем можно упростить код и просто для любого подразделения искать КПП обособки
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РегистрацииВНалоговомОрганеСрезПоследних.Организация КАК Организация,
			|	РегистрацииВНалоговомОрганеСрезПоследних.Подразделение КАК Подразделение,
			|	РегистрацииВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	РегистрацииВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане.КПП КАК КПП
			|ИЗ
			|	РегистрСведений.РегистрацииВНалоговомОргане.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И Подразделение = &Подразделение) КАК РегистрацииВНалоговомОрганеСрезПоследних";
		
		Запрос.УстановитьПараметр("Организация", Реализация.Организация);
		Запрос.УстановитьПараметр("Период", НовыйДокОбъект.Дата);
		Запрос.УстановитьПараметр("Подразделение", Реализация.Подразделение);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.КПП) Тогда
			НовыйДокОбъект.КППКонтрагента = Выборка.КПП;
		КонецЕсли;
	
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 22.04.2025
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Сканы");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;

	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьДокументПередачаТоваровМеждуОрганизациями(УжеСозданныйДокумент = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокОбъект = Документы.ПередачаТоваровМеждуОрганизациями.СоздатьДокумент();
	НовыйДокОбъект.Дата = Дата;
	
	НовыйДокОбъект.Организация = ОрганизацияПродавец;
	НовыйДокОбъект.ОрганизацияПолучатель = ОрганизацияПокупатель;
	НовыйДокОбъект.Валюта = Валюта;
	НовыйДокОбъект.ВалютаВзаиморасчетов = Валюта;
	НовыйДокОбъект.Склад = СкладПродажи;
	НовыйДокОбъект.Договор = ДоговорМеждуОрганизациями;
	Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.Договор) Тогда
		Сообщить("Не заполнен договор между организациями");
		Возврат Неопределено;
	КонецЕсли;
	Если Товары.Количество() > 0 И Товары[0].Характеристика.Лико_ЗаказНоменклатуры.Площадка = Справочники.Лико_Площадки.Линкс Тогда
		НовыйДокОбъект.Подразделение = Товары[0].Характеристика.Лико_ЗаказНоменклатуры.Площадка.ПодразделениеПроизводство;
	Иначе
		НовыйДокОбъект.Подразделение = НовыйДокОбъект.Договор.Подразделение;
	КонецЕсли;
	НовыйДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию;
	НовыйДокОбъект.ЦенаВключаетНДС = ЦенаВключаетНДС;
	НовыйДокОбъект.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
	НовыйДокОбъект.КурсЧислитель = 1;
	НовыйДокОбъект.КурсЗнаменатель = 1;
	НовыйДокОбъект.ПорядокРасчетов = НовыйДокОбъект.Договор.ПорядокРасчетов;
	НовыйДокОбъект.ГруппаФинансовогоУчета = НовыйДокОбъект.Договор.ГруппаФинансовогоУчета;
	НовыйДокОбъект.ГруппаФинансовогоУчетаПолучателя = НовыйДокОбъект.Договор.ГруппаФинансовогоУчетаПолучателя;
	НовыйДокОбъект.НалогообложениеНДС = НалогообложениеНДС;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	НовыйДокОбъект.ДатаПлатежа = НовыйДокОбъект.Дата;
	НовыйДокОбъект.НачалоПериода = НовыйДокОбъект.Дата;
	НовыйДокОбъект.КонецПериода = НовыйДокОбъект.Дата;
	НовыйДокОбъект.Менеджер = Автор;
	НовыйДокОбъект.ПередачаПодДеятельность = НовыйДокОбъект.НалогообложениеНДС;
	НовыйДокОбъект.Основание = НовыйДокОбъект.Договор.НаименованиеДляПечати;
	ЗаполнитьОтветственныхЛиц(НовыйДокОбъект);
	
	ТЗТовары = Товары.Выгрузить();
	ТЗТовары.Свернуть("Номенклатура,Характеристика,Цена,СтавкаНДС", "Количество,СуммаНДС,Сумма,СуммаСНДС");
	Для каждого Строка из ТЗТовары Цикл
		НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
	КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер,Сканы");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
		//+ Лико m.shenderov 19/01/2020
	Лико_Документ=Неопределено;
	//- Лико m.shenderov 19/01/2020

КонецПроцедуры

Процедура ЗаполнитьОтветственныхЛиц(НовыйДокОбъект)
	
	Если ЗначениеЗаполнено(ПодписьЗаРуководителя) Тогда
		НовыйДокОбъект.Руководитель = Лико_Дополнительно.НайтиЛицоСПравомПодписи(НовыйДокОбъект.Организация, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, ПодписьЗаРуководителя, НовыйДокОбъект.Дата);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПодписьЗаГлавногоБухгалтера) Тогда
		НовыйДокОбъект.ГлавныйБухгалтер = Лико_Дополнительно.НайтиЛицоСПравомПодписи(НовыйДокОбъект.Организация, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, ПодписьЗаГлавногоБухгалтера, НовыйДокОбъект.Дата); 
	КонецЕсли;
	Если ЗначениеЗаполнено(ПодписьОтпустил) Тогда
		НовыйДокОбъект.Отпустил = ПодписьОтпустил;
		НовыйДокОбъект.ОтпустилДолжность = Лико_Дополнительно.НайтиДолжностьФизЛица(НовыйДокОбъект.Отпустил, НовыйДокОбъект.Организация, НовыйДокОбъект.Дата);
		Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.ОтпустилДолжность) Тогда
			НовыйДокОбъект.ОтпустилДолжность = "Кладовщик";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ПроверяемыйРеквизитТоварыСтавкаНДС = ПроверяемыеРеквизиты.Найти("Товары.СтавкаНДС");
	Если ПроверяемыйРеквизитТоварыСтавкаНДС <> Неопределено И Товары.Количество() > 0 И ЗначениеЗаполнено(Товары[0].УдалитьСтавкаНДС) И НЕ ЗначениеЗаполнено(Товары[0].СтавкаНДС) Тогда
		// Это старый документ (на релизе 2.4), не будем проверять ставку, т.к. она перезаполнится перед записью
		ПроверяемыеРеквизиты.Удалить(ПроверяемыйРеквизитТоварыСтавкаНДС);
	КонецЕсли;
КонецПроцедуры

КлючиСтруктуры =	"СчетФактураПолученный,
					|ПриобретениеТоваровУслуг,
					|СчетФактураВыданный,
					|РеализацияТоваровУслуг,
					|ПередачаТоваровМеждуОрганизациями";
